Revit 2024 API
SymbolTypeId.Newton Property
 Symbol N, indicating unit Newtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Newton { get; }
Visual Basic
Public Shared ReadOnly Property Newton As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Newton {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace